{
  "dataset_name": "Constitution of India",
  "description": "Complete dataset of Indian Constitution including Articles, Fundamental Rights, Preamble, and Directive Principles",
  "last_updated": "2025-01-20",
  "source": "Constitution of India, Government of India",
  "parts": {
    "preamble": {
      "title": "Preamble to the Constitution of India",
      "articles": {
        "Preamble": {
          "title": "Preamble",
          "content": "WE, THE PEOPLE OF INDIA, having solemnly resolved to constitute India into a SOVEREIGN SOCIALIST SECULAR DEMOCRATIC REPUBLIC and to secure to all its citizens: JUSTICE, social, economic and political; LIBERTY of thought, expression, belief, faith and worship; EQUALITY of status and of opportunity; and to promote among them all FRATERNITY assuring the dignity of the individual and the unity and integrity of the Nation; IN OUR CONSTITUENT ASSEMBLY this twenty-sixth day of November, 1949, do HEREBY ADOPT, ENACT AND GIVE TO OURSELVES THIS CONSTITUTION.",
          "keywords": ["sovereignty", "socialism", "secularism", "democracy", "republic", "justice", "liberty", "equality", "fraternity"]
        }
      }
    },
    "part_i_union_and_territory": {
      "title": "Part I - The Union and its Territory (Articles 1-4)",
      "articles": {
        "Article 1": {
          "title": "Name and territory of the Union",
          "content": "India, that is Bharat, shall be a Union of States. The territory of India shall comprise: (a) the territories of the States; (b) the Union territories specified in the First Schedule; and (c) such other territories as may be acquired."
        },
        "Article 2": {
          "title": "Admission or establishment of new States",
          "content": "Parliament may by law admit into the Union, or establish, new States on such terms and conditions as it thinks fit."
        },
        "Article 3": {
          "title": "Formation of new States and alteration of areas, boundaries or names of existing States",
          "content": "Parliament may by law: (a) form a new State by separation of territory from any State or by uniting two or more States or parts of States or by uniting any territory to a part of any State; (b) increase the area of any State; (c) diminish the area of any State; (d) alter the boundaries of any State; (e) alter the name of any State."
        },
        "Article 4": {
          "title": "Laws made under articles 2 and 3 to provide for amendment of the First and the Fourth Schedules",
          "content": "Any law referred to in article 2 or article 3 shall contain such provisions for the amendment of the First Schedule and the Fourth Schedule as may be necessary to give effect to the provisions of the law and may also contain such supplemental, incidental and consequential provisions as Parliament may deem necessary."
        }
      }
    },
    "part_iii_fundamental_rights": {
      "title": "Part III - Fundamental Rights (Articles 12-35)",
      "articles": {
        "Article 12": {
          "title": "Definition of State",
          "content": "In this part, unless the context otherwise requires, 'the State' includes the Government and Parliament of India and the Government and the Legislature of each of the States and all local or other authorities within the territory of India or under the control of the Government of India."
        },
        "Article 14": {
          "title": "Right to Equality",
          "content": "The State shall not deny to any person equality before the law or the equal protection of the laws within the territory of India. This article ensures equal treatment of all individuals by the law, regardless of their status, position, or background."
        },
        "Article 15": {
          "title": "Prohibition of discrimination",
          "content": "The State shall not discriminate against any citizen on grounds only of religion, race, caste, sex, place of birth or any of them. However, nothing in this article shall prevent the State from making any special provision for women and children or for the advancement of any socially and educationally backward classes."
        },
        "Article 16": {
          "title": "Equality of opportunity in public employment",
          "content": "There shall be equality of opportunity for all citizens in matters relating to employment or appointment to any office under the State. No citizen shall, on grounds only of religion, race, caste, sex, descent, place of birth, residence or any of them, be ineligible for, or discriminated against in respect of, any employment or office under the State."
        },
        "Article 17": {
          "title": "Abolition of Untouchability",
          "content": "Untouchability is abolished and its practice in any form is forbidden. The enforcement of any disability arising out of Untouchability shall be an offence punishable in accordance with law."
        },
        "Article 18": {
          "title": "Abolition of titles",
          "content": "No title, not being a military or academic distinction, shall be conferred by the State. No citizen of India shall accept any title from any foreign State."
        },
        "Article 19": {
          "title": "Protection of certain rights regarding freedom of speech etc.",
          "content": "All citizens shall have the right to (a) freedom of speech and expression; (b) to assemble peaceably and without arms; (c) to form associations or unions; (d) to move freely throughout the territory of India; (e) to reside and settle in any part of the territory of India; and (f) to practise any profession, or to carry on any occupation, trade or business."
        },
        "Article 20": {
          "title": "Protection in respect of conviction for offences",
          "content": "No person shall be convicted of any offence except for violation of a law in force at the time of the commission of the act charged as an offence, nor be subjected to a penalty greater than that which might have been inflicted under the law in force at the time of the commission of the offence. No person shall be prosecuted and punished for the same offence more than once. No person accused of any offence shall be compelled to be a witness against himself."
        },
        "Article 21": {
          "title": "Protection of life and personal liberty",
          "content": "No person shall be deprived of his life or personal liberty except according to procedure established by law. This article is considered the heart of fundamental rights and has been interpreted broadly by the Supreme Court to include the right to live with human dignity, right to clean environment, right to health, right to education, and many other rights essential for meaningful existence."
        },
        "Article 21A": {
          "title": "Right to education",
          "content": "The State shall provide free and compulsory education to all children of the age of six to fourteen years in such manner as the State may, by law, determine. This was added by the 86th Amendment Act, 2002."
        },
        "Article 22": {
          "title": "Protection against arrest and detention",
          "content": "No person who is arrested shall be detained in custody without being informed, as soon as may be, of the grounds for such arrest nor shall he be denied the right to consult, and to be defended by, a legal practitioner of his choice. Every person who is arrested and detained in custody shall be produced before the nearest magistrate within a period of twenty-four hours of such arrest excluding the time necessary for the journey from the place of arrest to the court of the magistrate."
        },
        "Article 23": {
          "title": "Prohibition of traffic in human beings and forced labour",
          "content": "Traffic in human beings and begar and other similar forms of forced labour are prohibited and any contravention of this provision shall be an offence punishable in accordance with law."
        },
        "Article 24": {
          "title": "Prohibition of employment of children in factories, etc.",
          "content": "No child below the age of fourteen years shall be employed to work in any factory or mine or engaged in any other hazardous employment."
        },
        "Article 25": {
          "title": "Freedom of conscience and free profession, practice and propagation of religion",
          "content": "Subject to public order, morality and health and to the other provisions of this Part, all persons are equally entitled to freedom of conscience and the right freely to profess, practise and propagate religion."
        },
        "Article 26": {
          "title": "Freedom to manage religious affairs",
          "content": "Subject to public order, morality and health, every religious denomination or any section thereof shall have the right to establish and maintain institutions for religious and charitable purposes, to manage its own affairs in matters of religion, to own and acquire movable and immovable property and to administer such property in accordance with law."
        },
        "Article 27": {
          "title": "Freedom as to payment of taxes for promotion of any particular religion",
          "content": "No person shall be compelled to pay any taxes, the proceeds of which are specifically appropriated in payment of expenses for the promotion or maintenance of any particular religion or religious denomination."
        },
        "Article 28": {
          "title": "Freedom as to attendance at religious instruction or religious worship in certain educational institutions",
          "content": "No religious instruction shall be provided in any educational institution wholly maintained out of State funds. Nothing in this article shall apply to an educational institution which is administered by the State but has been established under any endowment or trust which requires that religious instruction shall be imparted in such institution."
        },
        "Article 29": {
          "title": "Protection of interests of minorities",
          "content": "Any section of the citizens residing in the territory of India or any part thereof having a distinct language, script or culture of its own shall have the right to conserve the same. No citizen shall be denied admission into any educational institution maintained by the State or receiving aid out of State funds on grounds only of religion, race, caste, language or any of them."
        },
        "Article 30": {
          "title": "Right of minorities to establish and administer educational institutions",
          "content": "All minorities, whether based on religion or language, shall have the right to establish and administer educational institutions of their choice. The State shall not, in granting aid to educational institutions, discriminate against any educational institution on the ground that it is under the management of a minority, whether based on religion or language."
        },
        "Article 32": {
          "title": "Right to Constitutional Remedies",
          "content": "The right to move the Supreme Court by appropriate proceedings for the enforcement of the rights conferred in this Part is guaranteed. The Supreme Court shall have power to issue writs, including writs in the nature of habeas corpus, mandamus, prohibition, certiorari and quo-warranto, whichever may be appropriate, for the enforcement of any of the rights conferred by this Part. Dr. B.R. Ambedkar called this article the 'heart and soul' of the Constitution."
        }
      }
    },
    "part_iv_directive_principles": {
      "title": "Part IV - Directive Principles of State Policy (Articles 36-51)",
      "articles": {
        "Article 36": {
          "title": "Definition of State",
          "content": "In this Part, unless the context otherwise requires, 'the State' has the same meaning as in Part III."
        },
        "Article 37": {
          "title": "Application of principles contained in this Part",
          "content": "The provisions contained in this Part shall not be enforceable by any court, but the principles therein laid down are nevertheless fundamental in the governance of the country and it shall be the duty of the State to apply these principles in making laws."
        },
        "Article 38": {
          "title": "State to secure a social order for the promotion of welfare of the people",
          "content": "The State shall strive to promote the welfare of the people by securing and protecting as effectively as it may a social order in which justice, social, economic and political, shall inform all the institutions of the national life. The State shall, in particular, strive to minimise the inequalities in income, and endeavour to eliminate inequalities in status, facilities and opportunities, not only amongst individuals but also amongst groups of people residing in different areas or engaged in different vocations."
        },
        "Article 39": {
          "title": "Certain principles of policy to be followed by the State",
          "content": "The State shall, in particular, direct its policy towards securing that the citizens, men and women equally, have the right to an adequate means of livelihood; that the ownership and control of the material resources of the community are so distributed as best to subserve the common good; that the operation of the economic system does not result in the concentration of wealth and means of production to the common detriment."
        },
        "Article 40": {
          "title": "Organisation of village panchayats",
          "content": "The State shall take steps to organise village panchayats and endow them with such powers and authority as may be necessary to enable them to function as units of self-government."
        },
        "Article 41": {
          "title": "Right to work, to education and to public assistance",
          "content": "The State shall, within the limits of its economic capacity and development, make effective provision for securing the right to work, to education and to public assistance in cases of unemployment, old age, sickness and disablement, and in other cases of undeserved want."
        },
        "Article 42": {
          "title": "Provision for just and humane conditions of work and maternity relief",
          "content": "The State shall make provision for securing just and humane conditions of work and for maternity relief."
        },
        "Article 43": {
          "title": "Living wage, etc., for workers",
          "content": "The State shall endeavour to secure, by suitable legislation or economic organisation or in any other way, to all workers, agricultural as well as industrial, work, a living wage, conditions of work ensuring a decent standard of life and full enjoyment of leisure and social and cultural opportunities."
        },
        "Article 44": {
          "title": "Uniform civil code",
          "content": "The State shall endeavour to secure for the citizens a uniform civil code throughout the territory of India."
        },
        "Article 45": {
          "title": "Provision for early childhood care and education to children below the age of six years",
          "content": "The State shall endeavour to provide early childhood care and education for all children until they complete the age of six years."
        },
        "Article 46": {
          "title": "Promotion of educational and economic interests of Scheduled Castes, Scheduled Tribes and other weaker sections",
          "content": "The State shall promote with special care the educational and economic interests of the weaker sections of the people, and, in particular, of the Scheduled Castes and the Scheduled Tribes, and shall protect them from social injustice and all forms of exploitation."
        },
        "Article 47": {
          "title": "Duty of the State to raise the level of nutrition and the standard of living and to improve public health",
          "content": "The State shall regard the raising of the level of nutrition and the standard of living of its people and the improvement of public health as among its primary duties and, in particular, the State shall endeavour to bring about prohibition of the consumption except for medicinal purposes of intoxicating drinks and of drugs which are injurious to health."
        },
        "Article 48": {
          "title": "Organisation of agriculture and animal husbandry",
          "content": "The State shall endeavour to organise agriculture and animal husbandry on modern and scientific lines and shall, in particular, take steps for preserving and improving the breeds, and prohibiting the slaughter, of cows and calves and other milch and draught cattle."
        },
        "Article 48A": {
          "title": "Protection and improvement of environment and safeguarding of forests and wild life",
          "content": "The State shall endeavour to protect and improve the environment and to safeguard the forests and wild life of the country."
        },
        "Article 49": {
          "title": "Protection of monuments and places and objects of national importance",
          "content": "It shall be the obligation of the State to protect every monument or place or object of artistic or historic interest, declared by or under law made by Parliament to be of national importance, from spoliation, disfigurement, destruction, removal, disposal or export, as the case may be."
        },
        "Article 50": {
          "title": "Separation of judiciary from executive",
          "content": "The State shall take steps to separate the judiciary from the executive in the public services of the State."
        },
        "Article 51": {
          "title": "Promotion of international peace and security",
          "content": "The State shall endeavour to promote international peace and security, maintain just and honourable relations between nations, foster respect for international law and treaty obligations in the dealings of organised peoples with one another, and encourage settlement of international disputes by arbitration."
        }
      }
    },
    "part_v_union_government": {
      "title": "Part V - The Union (Articles 52-151)",
      "articles": {
        "Article 52": {
          "title": "The President of India",
          "content": "There shall be a President of India who shall be the head of the Union executive. The executive power of the Union shall be vested in the President and shall be exercised by him either directly or through officers subordinate to him in accordance with this Constitution."
        },
        "Article 53": {
          "title": "Executive power of the Union",
          "content": "The executive power of the Union shall be vested in the President and shall be exercised by him either directly or through officers subordinate to him in accordance with this Constitution. Without prejudice to the generality of the foregoing provision, the supreme command of the Defence Forces of the Union shall be vested in the President and the exercise thereof shall be regulated by law."
        },
        "Article 54": {
          "title": "Election of President",
          "content": "The President shall be elected by the members of an electoral college consisting of the elected members of both Houses of Parliament and the elected members of the Legislative Assemblies of the States."
        },
        "Article 55": {
          "title": "Manner of election of President",
          "content": "As far as practicable, there shall be uniformity in the scale of representation of the different States at the election of the President. For the purpose of securing such uniformity among the States inter se as well as parity between the States as a whole and the Union, the number of votes which each elected member of Parliament and of the Legislative Assembly of each State is entitled to cast at such election shall be determined in the prescribed manner."
        },
        "Article 56": {
          "title": "Term of office of President",
          "content": "The President shall hold office for a term of five years from the date on which he enters upon his office. The President may, by writing under his hand addressed to the Vice-President, resign his office."
        }
      }
    }
  }
}