[
  {
    "section": "Section 1",
    "title": "Short title, extent and commencement",
    "text": "This Act may be called the Indian Contract Act, 1872. It extends to the whole of India except the State of Jammu and Kashmir and it shall come into force on the first day of September, 1872.",
    "type": "contract_act",
    "keywords": ["contract act", "title", "extent", "commencement", "1872"]
  },
  {
    "section": "Section 2",
    "title": "Interpretation clause",
    "text": "In this Act, unless there is something repugnant in the subject or context: (a) 'contract' means an agreement enforceable by law; (b) 'agreement' means every promise and every set of promises, forming the consideration for each other; (c) 'promise' means when the person to whom the proposal is made signifies his assent thereto, the proposal is said to be accepted. A proposal, when accepted, becomes a promise.",
    "type": "contract_act",
    "keywords": ["contract", "agreement", "promise", "proposal", "acceptance", "consideration", "definition"]
  },
  {
    "section": "Section 3",
    "title": "Communication, acceptance and revocation of proposals",
    "text": "The communication of a proposal is complete when it comes to the knowledge of the person to whom it is made. The communication of an acceptance is complete, as against the proposer, when it is put in a course of transmission to him, so as to be out of the power of the acceptor; and as against the acceptor, when it comes to the knowledge of the proposer.",
    "type": "contract_act",
    "keywords": ["communication", "proposal", "acceptance", "revocation", "transmission", "knowledge"]
  },
  {
    "section": "Section 10",
    "title": "What agreements are contracts",
    "text": "All agreements are contracts if they are made by the free consent of parties competent to contract, for a lawful consideration and with a lawful object, and are not hereby expressly declared to be void.",
    "type": "contract_act",
    "keywords": ["agreements", "contracts", "free consent", "competent", "lawful consideration", "lawful object", "void"]
  },
  {
    "section": "Section 11",
    "title": "Who are competent to contract",
    "text": "Every person is competent to contract who is of the age of majority according to the law to which he is subject, and who is of sound mind, and is not disqualified from contracting by any law to which he is subject.",
    "type": "contract_act",
    "keywords": ["competent to contract", "age of majority", "sound mind", "disqualified", "capacity"]
  },
  {
    "section": "Section 12",
    "title": "What is sound mind for the purpose of contracting",
    "text": "A person is said to be of sound mind for the purpose of making a contract, if, at the time when he makes it, he is capable of understanding it and of forming a rational judgment as to its effect upon his interests.",
    "type": "contract_act",
    "keywords": ["sound mind", "contracting", "understanding", "rational judgment", "interests"]
  },
  {
    "section": "Section 13",
    "title": "Consent defined",
    "text": "Two or more persons are said to consent when they agree upon the same thing in the same sense.",
    "type": "contract_act",
    "keywords": ["consent", "agreement", "same thing", "same sense"]
  },
  {
    "section": "Section 14",
    "title": "Free consent defined",
    "text": "Consent is said to be free when it is not caused by coercion, undue influence, fraud, misrepresentation, or mistake.",
    "type": "contract_act",
    "keywords": ["free consent", "coercion", "undue influence", "fraud", "misrepresentation", "mistake"]
  },
  {
    "section": "Section 15",
    "title": "Coercion defined",
    "text": "Coercion is the committing, or threatening to commit, any act forbidden by the Indian Penal Code, or the unlawful detaining, or threatening to unlawfully detain, any property, to the prejudice of any person whatever, with the intention of causing any person to enter into an agreement.",
    "type": "contract_act",
    "keywords": ["coercion", "threatening", "forbidden", "unlawful detention", "prejudice", "agreement"]
  },
  {
    "section": "Section 16",
    "title": "Undue influence defined",
    "text": "A contract is said to be induced by undue influence where the relations subsisting between the parties are such that one of the parties is in a position to dominate the will of the other and uses that position to obtain an unfair advantage over the other.",
    "type": "contract_act",
    "keywords": ["undue influence", "dominate", "unfair advantage", "relations", "position"]
  },
  {
    "section": "Section 17",
    "title": "Fraud defined",
    "text": "Fraud means and includes any of the following acts committed by a party to a contract, or with his connivance, or by his agent, with intent to deceive another party thereto or his agent, or to induce him to enter into the contract: the suggestion, as a fact, of that which is not true, by one who does not believe it to be true; the active concealment of a fact by one having knowledge or belief of the fact; a promise made without any intention of performing it; any other act fitted to deceive; any such act or omission as the law specially declares to be fraudulent.",
    "type": "contract_act",
    "keywords": ["fraud", "deceive", "suggestion", "concealment", "promise", "intention", "fraudulent"]
  },
  {
    "section": "Section 18",
    "title": "Misrepresentation defined",
    "text": "Misrepresentation means and includes the positive assertion, in a manner not warranted by the information of the person making it, of that which is not true, though he believes it to be true; any breach of duty which, without an intent to deceive, gains an advantage to the person committing it, or anyone claiming under him, by misleading another to his prejudice, or to the prejudice of anyone claiming under him; causing, however innocently, a party to an agreement, to make a mistake as to the substance of the thing which is the subject of the agreement.",
    "type": "contract_act",
    "keywords": ["misrepresentation", "positive assertion", "breach of duty", "misleading", "mistake", "substance"]
  },
  {
    "section": "Section 23",
    "title": "What considerations and objects are lawful, and what not",
    "text": "The consideration or object of an agreement is lawful, unless it is forbidden by law; or is of such a nature that, if permitted, it would defeat the provisions of any law; or is fraudulent; or involves or implies injury to the person or property of another; or the Court regards it as immoral, or opposed to public policy.",
    "type": "contract_act",
    "keywords": ["consideration", "object", "lawful", "forbidden by law", "fraudulent", "injury", "immoral", "public policy"]
  },
  {
    "section": "Section 25",
    "title": "Agreement without consideration is void",
    "text": "An agreement made without consideration is void, unless it is in writing and registered under the law for the time being in force for the registration of documents, and is made on account of natural love and affection between parties standing in a near relation to each other; or unless it is a promise to compensate, wholly or in part, a person who has already voluntarily done something for the promisor, or something which the promisor was legally compellable to do; or unless it is a promise, made in writing and signed by the person to be charged therewith, or by his agent generally or specially authorised in that behalf, to pay wholly or in part a debt of which the creditor might have enforced payment but for the law for the limitation of suits.",
    "type": "contract_act",
    "keywords": ["agreement", "consideration", "void", "writing", "registered", "natural love", "affection", "compensation", "debt", "limitation"]
  },
  {
    "section": "Section 56",
    "title": "Agreement to do impossible act",
    "text": "An agreement to do an act impossible in itself is void. A contract to do an act which, after the contract is made, becomes impossible, or, by reason of some event which the promisor could not prevent, unlawful, becomes void when the act becomes impossible or unlawful.",
    "type": "contract_act",
    "keywords": ["impossible act", "void", "contract", "unlawful", "prevent", "event"]
  },
  {
    "section": "Section 73",
    "title": "Compensation for loss or damage caused by breach of contract",
    "text": "When a contract has been broken, the party who suffers by such breach is entitled to receive, from the party who has broken the contract, compensation for any loss or damage caused to him thereby, which naturally arose in the usual course of things from such breach, or which the parties knew, when they made the contract, to be likely to result from the breach of it.",
    "type": "contract_act",
    "keywords": ["compensation", "breach of contract", "loss", "damage", "naturally arose", "usual course", "likely to result"]
  },
  {
    "section": "Section 74",
    "title": "Compensation for breach of contract where penalty stipulated for",
    "text": "When a contract has been broken, if a sum is named in the contract as the amount to be paid in case of such breach, or if the contract contains any other stipulation by way of penalty, the party complaining of the breach is entitled, whether or not actual damage or loss is proved to have been caused thereby, to receive from the party who has broken the contract reasonable compensation not exceeding the amount so named or, as the case may be, the penalty stipulated for.",
    "type": "contract_act",
    "keywords": ["compensation", "breach", "penalty", "stipulated", "actual damage", "reasonable compensation", "amount"]
  }
]